# 5)შექმენი ფუნქცია სადაც იქნება მოთავსებული რენდომ ტიპის ელემენტები,თქვენი დავალებაა ამოშალოთ ამ სიიდან ბოლო ინდექსზე მდგომი ელემენტი,
#ჩაამატო ამ სიაში რიცხვი 20 ბოლო ინდექსზე,
#ამოშალო სიიდან რომელიმე სტრინგ ტიპის მონაცემი,ჩაამატო ამ სიაშ მე 4 ინდექსზე სტრინგი"atami" ,გამოიყენე შესაბამისი სიის ფუნქციები

list = [42, "hello", 3.14, True]
list.pop(3)  
print(list)

list1 = [10, 68, 734, 20]
list1.remove(20)
print(list1)

def sia(lst):
    result = []
    for i in lst:
        if type(i) != str:
            result.append(i)
    result.insert(4, "atami")

    return result
    

