# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება მხოლოდ რიცხვები და სტრინგ ტიპის მონაცეემები,
#თქვენი დავალებაა რომ ამ სიიდან ამოიღოთ ინტეჯერ ტიპის მონაცემეები და დაამატოთ ახალ სიაში,და ასევე უნდა ამოიღო სიიდან სტრინგ ტიპის მონაცემები და 
#დაამატო ესეც სხვა ახალ სიაში,თქვენი დავალებაა რომ 
#რიცხვებით სავსე სია დაალაგოთ ზრდადიბის მიხედვით და სტრრინგების სია დაალაგოთ სიაში მოთავსებული სიტყვების სიგრძის მიხედვით

def sia(list):
    int_sia = []
    str_sia = []
    for i in list:
        if type(i) == int:
            int_sia.append(i)
        elif type(i) == str:
            str_sia.append(i)
    return sorted(int_sia), sorted(str_sia, key=len)



