// 1)შექმენით სია სადაც მოათავსებთ ადამიანების სახელებს,თქვენი დავალებაა რომ გამოიტანოთ
//  ადამიანების სახელები ცალ ცალკე forEach() ის გამოყენებით
let list = ['Andria', 'Goga', 'Merabi', 'Demetre', 'Nika']
list.forEach(item => {
    console.log(item)
})

// 2)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,
// თქვენი დავალებაა გამოიტანოთ ისეთი ელემენტები რომლებიც დგანან ლუწ ინდექსზე
let list1 = ['Andria', 'Goga', 'Merabi', 'Demetre', 'Nika']
list1.forEach((item, index) => {
    if(index % 2 === 0) {
        console.log(item)
    }
})

// 3)შექმენით სია სადაც მოათავსებთ განსხვავებული ტიპის მონაცემებს,
// თქვენი დავალებაა გამოიტანოთ მხოლოდ სტრინგ ტიპის მოანცემები
let list2 = ['Andria', 9, 'Merabi', 80, 'Nika']
list2.forEach(item =>{
    if(typeof item === String){
        console.log(item)
    }
})

// 4)რიცხვების გაორმაგება
// let numbers = [4, 7, 12, 15, 20, 25];

// .map()-ის გამოყენებით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი იქნება 2-ჯერ მეტი.
let numbers = [4, 7, 12, 15, 20, 25]
const list3 = numbers.map(item => item * 2)

// 5)let numbers = [3, 5, 7, 9, 12];

// .map()-ით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი აყვანილი იქნება კვადრატში.
let numbers1 = [3, 5, 7, 9, 12]
const list4 = numbers1.map(item => item * item)

// 6)რიცხვებზე პირობის გამოყენება
// let numbers = [5, 12, 7, 20, 33, 40, 18];

// .map()-ის გამოყენებით შექმენი ახალი მასივი:

// თუ რიცხვი ლუწია → დააბრუნე ეს რიცხვი გაამრავლებული 2-ზე
// თუ კენტია → დააბრუნე ეს რიცხვი გამრავლებული 3-ზე
let numbers2 = [5, 12, 7, 20, 33, 40, 18]
const list5 = numbers2.map(item => item %2 === 0 ? item * 2 : item * 3)