// 1)შექმენით სია სადაც მოათავსებთ ადამიანის სახელებს , 
// შენი დავალებაა რომ გაიგო თუ ამ ელემენტშ გვხვდება ერთ 
// ელემენტი მაინც ისეთი რომელის იწყება ასო გ ზე და მისი სიგრძე მეტია 6 ზე , 
// თუ ამ პირობას შეასრულებს სიიდან რომელიმე ელემენტი დააბრუნე true შესაბამისი მეთოდის გამოყენებით
let names = ['Andria', 'Nika', 'Dato', 'Merabi', 'Ilia']
let result = names.some(item => item.startsWith('G') && item.length > 6)
console.log(result)

// 2)შექმენით სია სადაც მოათავსებთ რიცხვებს , 
// შენი დავაელაბა რომ გაიგო თუ ამ სიაში ყველა რიცხვი არის ლუწი და ასევე 10 ზე მეტი , 
// თუ ყველა ელემენტი დააკმაყოფილებს პირობას დააბრუნეთ true Sesabamisi მეთოდის გამოყენებით თუ არა და false
let numbers = [12, 14, 16, 18, 20]
let result1 = numbers.every(num => num % 2 === 0 && num > 10)
console.log(result1)