// 1)შექმენით arrow ფუნქცია რომელსაც გადაეცემა პარამეტრი სახელად names , გამოძახხების შემდეგ გადაეცით სახელების სია
// შენი დავალებაა ფუნქციამ დააბრუნოს სიის სიგრძე
const arrow = names => names.length
arrow(["Andria", "Goga", "Dato"])

// 2)შექმენით funcion expression ფუნქცია რომელსაც გადაეცემა პარამეტრი სახელად elements , გამოძახხების შემდეგ გადაეცით თქვენთვის სასურველი ელემენტები
// შენი დავალებაა ფუნქციამ ამოშალოს სიიდან ბოლო ელემენტი და ამის შემდეგ დააბრუნოს საბოლოო სია
const list = function(elements) {
    elements.pop();
    return elements;
}
list(["Andria", "Goga", "Dato"])

// 3)შექმენით default ფუნქცია რომელსაც გადაეცემა პარამეტრი სახელად numbers , გამოძახხების შემდეგ გადაეცით თქვენთვის სასურველი ელემენტები
// შენი დავალებაა ფუნქციამ დაამატოს სიის ბოლო ელემენტი და ამის შემდეგ დააბრუნოს საბოლოო სია
function addLast(numbers = []) {
    numbers.push(100);
    return numbers;
}
addLast([1, 2, 3])


// 4)შექმენი arrow ფუნქცია
// ფუნქციას გადაეცი პარამეტრი რომელიც იქნება გამოძახების დროს რაიმე სია
// შენი დავალებაა რომ ამ სიის პირველ ადგილზე დაამატო "traqtori" და სიის ბოლოში დაამატო "manqana" და დააბრუნო საბოლოო სია
const arrow = list => {
    list.unshift('traqtori');
    list.push('manqana');
    return list;
}

arrow(["Andria", "Goga", "Dato"])

// 5)შექმენი arrow ფუნქცია
// ფუნქციას გადაეცი პარამეტრი რომელიც იქნება გამოძახების დროს რაიმე სია
// შენი დავალებაა რომ ამ სიის პირველ ადგილზე მდგომი ელემენტი ამოშალო და აასევე ამოშალო ბოლოს
// მდგომი ელემენტი და დააბრუნო საბოლოო სია

const arrow = list => {
    list.shift();
    list.pop();
    return list;
}

arrow(["Andria", "Goga", "Dato"])

// 6)შექმენი arrow ფუნქცია
// ფუნქციას გადაეცი პარამეტრი რომელიც იქნება გამოძახების დროს რაიმე სია და ასევე გამოიძახე
// კდიევ რამდენჯერმე მაგრამ სიის მაგივრად გადაეცი სხვა მინაცემთა ტიპის ელემტნი
// ფუქნციამ უნდა დააბრუნოს არის თ არა პარამეტრშ შენახული არგუმენტი სია

const arrow = list => Array.isArray(list);
arrow(["Andria", "Goga", "Dato"])