# 4)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება როგორც სტრინგები ასევე ინტეჯერები,
#თქვენი დავალებაა სტრინგ ტიპის მონაცემები ჩაამატო ახალ შექმნილ სიაში და დაასორტირო ანბანის მიხედვით,
#ხოლო ინტეჯერებიც ჩაამატე სხვა ახალ სიაში და ეს საბოლოო სიაც დაასორტირე თან შემოატრიალე

def sia(list):
    int_sia = []
    str_sia = []
    for i in list:
        if type(i) == int:
            int_sia.append(i)
        elif type(i) == str:
            str_sia.append(i)
    return int_sia.sort(reverse = True), str_sia.sort()  

