# 1) სია მანქანის ბრენდის სახელებით
car_brands = ["Toyota", "BMW", "Mercedes", "Audi", "Ford"]

# 2) სია მხოლოდ ინტეჯერის ტიპის რიცხვებით
integer_numbers = [1, 2, 3, 4, 5]

# 3) სია მხოლოდ float ტიპის რიცხვებით
float_numbers = [1.1, 2.2, 3.3, 4.4, 5.5]

# 4) სია ყველა მონაცემთა ტიპის ელემენტებით
mixed_list = ["ტექსტი", 42, 3.14, True,]
# ინდექსები:
#  0 -> "ტექსტი" (სტრინგი)
#  1 -> 42 (ინტეჯერი)
#  2 -> 3.14 (ფლოუტი)
#  3 -> True (ბულეანი)
# უარყოფითი ინდექსები:
# -5 -> "ტექსტი"
# -4 -> 42
# -3 -> 3.14
# -2 -> True


# 5) სია ყველა მონაცემთა ტიპის ელემენტებით და თითოეული ელემენტის ცალკე გამოტანა
for element in mixed_list:
    print(element)

# 6) სია ყველა მონაცემთა ტიპის ელემენტებით და მთლიანი სიის გამოტანა
print(mixed_list)

# 7) მოცემული სიის ტექსტის ფორმატირება
example_list = ["გიორგი", 15, 50.50, "წლის"]
print(f"{example_list[0]} {example_list[1]} {example_list[3]}")

# 8) მოცემული სიის ელემენტების შეცვლა
example_list2 = ["აკადემია", 50, "ბექა", 60.5, "ირაკლი"]
example_list2[0] = "გოა"  # მენულე ინდექსის შეცვლა
example_list2[-1] = "საბა"  # ბოლო ინდექსის შეცვლა
print(example_list2)