# სია სადაც მოთავსებული იქნება მხოლოდ string ტიპის მონაცემები
string_list = ["apple", "banana", "cherry"]

# სია სადაც მოთავსებული იქნება მხოლოდ integer ტიპის მონაცემები
integer_list = [1, 2, 3, 4, 5]

# სია სადაც მოთავსებული იქნება მხოლოდ float ტიპის მონაცემები
float_list = [1.1, 2.2, 3.3, 4.4]

# სია სადაც მოთავსებული იქნება ყველა მონაცემთა ტიპის ელემენტები
mixed_list = ["text", 42, 3.14, True,]


["cat","purple",21,150.6,True]
# "cat" დგას ინდექსზე 0
# "purple" დგას ინდექსზე 1
# 21 დგას ინდექსზე 2
# 150.6 დგას ინდექსზე 3
# True დგას ინდექსზე 4