#1)1 დან 10 მდე გაიგეთ რიცხვების ჯამი,გამოიყენეთ for loop
sum = 0
for i in range(1,10):
    sum += i
print(sum)

#2)შექმენით ფუნქცია რომელიც გაიგებს ორი რიცხვის ჯამს

def sum(x,y):
    return x + y

print(sum(2,3))

#3)შექმენით ფუნქცია რომელიც გაიგებს სიაში მყოფი ლუწი რიცხვების ჯამს

def luwi_rocxvebis_jami(list):
    result = 0
    for i in list:
        if i % 2 == 0:
            result += i
    return result

print(luwi_rocxvebis_jami([2, 4, 3, 5]))


#4)შექმენით ფუნქცია რომელსაც გადაეცემა წინადადება დაა თითოეული სიტყვა ამ წინადადებაში გამოყოფილი იყოს სფეისებით,
#თქვენი დავალებაა ამ წინადადებაში მყოფი სიტყვები წარმოაგგინოთ სიის სახით(გამოიყენეთ შესაბამისი ფუნქცია),
#შემდეგ ამ სიას გადაუარეთ და შეამოწმეთ,თუ ამ სიაშიმოცემულუ სიტყვის სიგრძე ნაკლებიაა 5 ზე,
#დაპრინტეთ ნაკლებია 5 ზე,სხვა შემთხვევაში დაპრინტეთ მეტია 5 ზე

def davyot_winadadeba_sityvebad(sityva):
    dayofili = sityva.split()
    for i in dayofili:
        if len(i) < 5:
            print("სიტყვა ნაკლებია 5-ზე")
        else:
            print("სიტყვა მეტია 5-ზე")
    
#5)შექმენით ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული უნდა იყოს სხვადასხვა მონაცემთა ტიპები,
#შენი დავალებაა გაიგო თუ ამ სიაში იმყოფება სტრინგი,მაშინ ეს სტრინგი ჩაამატე ახალ სიაში,შემდეგ ეს სია
#სადაც შენახული გექნებათ სტრინგები გადმოიყვანოთ ერთ მთლიან სტრინგად და თითოეული ელემენტი 
#ერთმანეთისგან დაშორებული იყოს # ნიშნით,
#შემდეგ დაითვალეთ,თუ რამდენი # ეს ნიშანი გვხვდება ამმსტრინგში

def sia(list):
    str_list = []
    for i in list:
        if type(i) == str:
            str_list.append(i)
    gaertianeba= '#'.join(str_list)
    datvla = gaertianeba.count('#')
    return gaertianeba, datvla


#6)შექმენით ფუნქცია რომელსაც გადასცემთ რიცხვებით სავსე სიას,
#თქვენი დავალებაა შეამოწმოთ თუ ამ სიაში მყოფი რიცხვების საშუალო არითმეტიკული მეტია 20ზე მაგ შემთხვევაში
#0 დან მიღებული საშუალო არითმეტიკულამდე დაატრიალეთ ფორ ციკლი,შენი დავალებაა გაიგო ამ დიაპაზონში 
#ლუწი რიცხვების რაოდენობა და კენტი რიცხვების ჯამი,სხვა შემთხვევაში,
#დაითვალე 0 დან საშუალო მიღებულ საშუვალო არითმეტიკულამდე და გამოიტანო თითეული რიცხვი