// 1)შექმენი 4 სია, 
// პირველ სიაში შეინახე მხოლოდ სტრინგები
// მეორე სიაში შეინახე მხოლოდ რიცხვები
// მესამე სიაში შეინახე მხოლოდ boolean მონაცემები
// მეოთხე სიაში შეინახე ნამბერი,სტრინგი და ბულეან ტიპის მონაცემები ერთად
// გამოიტანე ოთხივე სია კონსოლში ცალ ცალკე

let list1 = ['Andria', 'Dato', 'Nika']
let list2 = [1, 3, 5, 6, 90]
let list3 = [true, false]
let list4 = [ 4, 7 ,9, 'Sandro', 'Merabi', true, false]
console.log(list1)
console.log(list2)
console.log(list3)
console.log(list4)

// 2)შექმენი სია --> ["გიო" , 100 , true , "ალექსანდრე" , "ირინა" , false, 405.1 ]
// შენი დავალებაა რომ კონსოლში გამოიტანო --> "ალექსანდრე" , შემდეგ false , შემდეგ 100 , შემდეგ "ირინა"

let list = ["გიო" , 100 , true , "ალექსანდრე" , "ირინა" , false, 405.1 ]
console.log(list[3])
console.log(list[5])
console.log(list[1])
console.log(list[4])


// 3)შექმენით სია  ["გიო" , 100 , true , "ალექსანდრე" , "ირინა" , false, 405.1 ]
// შენი დავალებაა "gio" შეცვალოთ თქვენი სახელით
// true --> false
// 405.1 --> 10.4
// ალექსანდრე --> ალექსი
// ირინა --> პაატა
// ბოლოს გამოიტანე სია და ნახეთ შედეგი


let list =  ["გიო" , 100 , true , "ალექსანდრე" , "ირინა" , false, 405.1 ]

list[0] = 'Andria'
list[2] = false
list[6] = 10.4
list[3] = 'ალექსი'
list[4] = 'პაატა'
console.log(list)