// 1)მოცემული გაქვთ ფუნქცია რომელსაც აქვს პარამეტრები --> str 
// (რაიმე წინადადებაა სადაც სიტყვები გამოყოფილია სფეისებით,გამოძახების დროს გაითვალისწინეთ)
// შენი დავალება ფუნქციამ დააბრუნოს ამ პარამეტრში მყოფი სიტყვები ცალ ცალკე სიის სახით
// გამოიახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

function word(str){
    return str.split(' ')
}

// 2)მოცემული გაქვთ ფუქნცია რომელსაც აქვს პარამეტრი --> list (სადაც მოცემულია სია რომელშიც არის სტრინგები)
// შენი დავალებააა ფუქციამ დააბრუნოს ეს სია გადაყვანილი სტრინგში
// სადაც თითოეული ელემენტი უნდა იყოს გამოყოფილი "#" ნიშნით,გამოიძახეთ ფუნქცია რამდნეჯერმე სხვადასხვა არგუმენტებით

function listToString(list){
    return list.join('#')
}

listToString(['Andria', 'Goga', 'Nika'])
listToString(['vashli', 'banana', 'atami'])