// 1)მომხმარებელს შემოატანინე სახელი prompt-ით.
// თუ სახელი იწყება "A" ასოზე, კონსოლში გამოიტანე "სახელი იწყება A-ზე", სხვა შემთხვევაში "სახელი არ იწყება A-ზე".
let name = prompt("Enter a name:");
if (name.startsWith("A")) {
    console.log("სახელი იწყება A-ზე");
}
else {
    console.log("სახელი არ იწყება A-ზე");
}

// 2)მომხმარებელს შემოატანინე პაროლი.
// თუ პაროლის სიგრძე 8-ზე მეტია, გამოიტანე "ძლიერი პაროლი", სხვა შემთხვევაში "სუსტი პაროლი". გამოიყენე property რომელიც იგებს სტრინგის სიგრძეს.
let password = prompt("Enter a password:");
if (password.length > 8) {
    console.log("ძლიერი პაროლი");
}
else {
    console.log("სუსტი პაროლი");
}

// 3)მომხმარებელს შემოატანინე ტექსტი.
// trim() გამოიყენე და თუ ტექსტის სიგრძე 0 გამოვიდა, დაწერე "ცარიელი ტექსტია", სხვა შემთხვევაში "ტექსტი შევსებულია".
let text = prompt("Enter a text:"); 
if (text.trim().length === 0) {
    console.log("ცარიელი ტექსტია");
}
else { 
    console.log("ტექსტი შევსებულია");
}

// 4)მომხმარებელს შემოატანინე რაიმე სახელი
//  თუ სახელი იწყება ასო "ა" ზე გამოიტანე კონსოლში ცვლადში შენახული მნშვნელკობა ოღონდ დიდი ასოებით
// სხვა შემთხვევაში გამოიტანე ცვლადში შენახული მნიშვნელობა პატარა ასოებში

let name1 = prompt("Enter a name:");
if (name1.startsWith("ა")) {
    console.log(name1.toUpperCase());
}
else {
    console.log(name1.toLowerCase());
}

// 5)შექმენი ცვლადი სადაც შეინახავ რაიმე სტრინგს
// შეამოწმე თუ სახელი იწყება ასო"კ" ზე კონსოლში გამოიტანე ამ ცვლადში შენახულიმნიშვნელობის სიგრძე
// სხვა შემთხვევაში დაუკონსოლლოგე __> "error"

let str = "კარგი"
if (str.startsWith("კ")) {
    console.log(str.length);
}
else {
    console.log("error");
}
