// 1)შექმენი ფუნცცია სახელად greet ,შიგნით შექმენი ცვლადი სახელად name და შეინახე რაიმე სახელი,
// შენი დავალებააა ფუნქციაში დააკონსოლლლოგო --> 
// გამარჯობა ჩემი სახელია + name
// გამოიძახე ფუნქცია რომ ნახო შედეგი,ახსენი რატომ გამოიტანა ეს შედეგი კომენტარის სახით 
// შემდეგ ფუნქციის გარეთ დააკოლსოოლოგე name ცვლადი და ახსენი თუ რა მოხდა და რატომ მოხდა ასე

function greet(){
    let name = 'Andria'
    console.log(`Hello my name is ${name}`)
}

greet()
// ეს შედეგი გამოიტანა იმიტომ რომ name ცვლადი ფუნქციის შიგნით არის განსაზღვრული და ფუნქციის გარეთ არ ჩანს.
console.log(name)
// ეს გამოიტანა იმიტომ რომ name ცვლადი ფუნქციის შიგნით არის განსაზღვრული და ფუნქციის გარეთ არ ჩანს,
// ამიტომაც name ცვლადი ფუნქციის გარეთ არ არის ცნობილი და გამოიტანა შეცდომა.